In [80]:
import pandas as pd

In [81]:
pd.Series(['banana', 42])

0    banana
1        42
dtype: object

In [82]:
pd.Series(['banana', 42], index=['name', 'age'])

name    banana
age         42
dtype: object

In [83]:
pd.Series(['banana', 42], index=['name', 'age'], name='kind')

name    banana
age         42
Name: kind, dtype: object

In [84]:
pd.DataFrame({
    'Name':['Framklin', 'Gosset'],
    'Born':['1920-07-25', '1876-06-03'],
    'Age':[37, 61]
})

       Name        Born  Age
0  Framklin  1920-07-25   37
1    Gosset  1876-06-03   61

In [85]:
pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], 
             columns=['a','b','c'])

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [86]:
df = pd.read_csv('data/scientists.csv')

In [87]:
df.head(2)

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician

In [88]:
df.tail(2)

           Name        Born        Died  Age          Occupation
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [89]:
df.sample(2)

                Name        Born        Died  Age    Occupation
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist

In [90]:
df.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [91]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [92]:
df.values

array([['Rosaline Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Rachel Carson', '1907-05-27', '1964-04-14', 56, 'Biologist'],
       ['John Snow', '1813-03-15', '1858-06-16', 45, 'Physician'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41,
        'Computer Scientist'],
       ['Johann Gauss', '1777-04-30', '1855-02-23', 77, 'Mathematician']],
      dtype=object)

In [93]:
df.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [95]:
df.keys()

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [96]:
df.sum()

Name          Rosaline FranklinWilliam GossetFlorence Nighti...
Born          1920-07-251876-06-131820-05-121867-11-071907-0...
Died          1958-04-161937-10-161910-08-131934-07-041964-0...
Age                                                         473
Occupation    ChemistStatisticianNurseChemistBiologistPhysic...
dtype: object

In [97]:
# df.mean
df['Age'].mean()

59.125

In [98]:
# 요약 통계량 계산
df.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [99]:
# 중복값이 없는 시리즈 반환
df.drop_duplicates()

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [100]:
# df.drop_duplicates(subset=['brand'])

In [101]:
df = pd.read_csv('data/scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [102]:
# 값을 정렬
df.sort_values('Name')

                   Name        Born        Died  Age          Occupation
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
5             John Snow  1813-03-15  1858-06-16   45           Physician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician

In [103]:
df.sort_values('Age')

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse

In [104]:
df.sort_values(['Name', 'Age'])

                   Name        Born        Died  Age          Occupation
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
5             John Snow  1813-03-15  1858-06-16   45           Physician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician

In [105]:
df.sort_values(['Name', 'Age'], ascending=False) 
# ascending (오름차순) default는 True

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
5             John Snow  1813-03-15  1858-06-16   45           Physician
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [106]:
# 시리즈를 데이터프레임으로 변환
df['Age'].to_frame()

   Age
0   37
1   61
2   90
3   66
4   56
5   45
6   41
7   77

In [107]:
df['Age'].mean()

59.125

In [108]:
# df[조건식]  # True, False
# 나이가 평균보다 많은 사람 구하기
df[df['Age'] >= df['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [109]:
# df[조건식]  # True, False
# 나이가 평균보다 많은 사람 구하기
df['Age'] >= df['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [110]:
cond1 = df['Age'] >= df['Age'].mean()

In [111]:
df[cond1]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [112]:
df[[True,False,True,False,True,False,True,False]]

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [113]:
df['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [114]:
df['Age'] + df['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [115]:
df['Age'] + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [116]:
df['Age'] + pd.Series([1,100])
# 값이 하나라도 NaN이면 결과도 NaN으로 나온다.

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [117]:
rev_age = df['Age'].sort_index(ascending=False)

In [118]:
rev_age

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [119]:
rev_age + df['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [121]:
pd.to_datetime(df['Born'])

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [122]:
born_datetime = pd.to_datetime(df['Born'], format='%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [123]:
died_datetime = pd.to_datetime(df['Died'], format='%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [124]:
df['born_dt'], df['died_dt'] = (born_datetime, died_datetime)
df

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [139]:
df['died_dt']-df['born_dt']

0   13779 days
1   22404 days
2   32964 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [127]:
# pd.to_datetime('2023년 12월 8일')  # format을 붙이지 않으면 error가 발생함.
pd.to_datetime('2023년 12월 8일', format='%Y년 %m월 %d일')

Timestamp('2023-12-08 00:00:00')

In [141]:
df

,Name,Born,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,90,Nurse,1820-05-12,1910-08-13
4,Rachel Carson,1907-05-27,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,77,Mathematician,1777-04-30,1855-02-23

In [142]:
# df.drop('Born', axis=0) # 행, 열
# 열 단위 지우기
df.drop('Born', axis=1)

                   Name  Age          Occupation    born_dt    died_dt
0     Rosaline Franklin   37             Chemist 1920-07-25 1958-04-16
1        William Gosset   61        Statistician 1876-06-13 1937-10-16
2  Florence Nightingale   90               Nurse 1820-05-12 1910-08-13
4         Rachel Carson   56           Biologist 1907-05-27 1964-04-14
5             John Snow   45           Physician 1813-03-15 1858-06-16
6           Alan Turing   41  Computer Scientist 1912-06-23 1954-06-07
7          Johann Gauss   77       Mathematician 1777-04-30 1855-02-23

In [144]:
# 행 단위 지우기
df.drop(1, axis = 0)

,Name,Born,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,37,Chemist,1920-07-25,1958-04-16
2,Florence Nightingale,1820-05-12,90,Nurse,1820-05-12,1910-08-13
4,Rachel Carson,1907-05-27,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,77,Mathematician,1777-04-30,1855-02-23

In [145]:
# df = df.drop(columns=['Died'], index=[3])
df.drop(columns=['Died'], index=[3])

KeyError: '[3] not found in axis'

In [146]:
# csv로 저장
df.to_csv('test.csv')